In [4]:
import pandas as pd
print(pd.__version__)

1.0.5

In [7]:
data = {
    "names":["길동","둘리","철수"],
    "age":[20,10,30],
    "addr":['서울','경기','부산']
    
}
#dataframe 객체 생성
data_df = pd.DataFrame(data)
data_df.head()

  names  age addr
0    길동   20   서울
1    둘리   10   경기
2    철수   30   부산

In [8]:
for idx,row in data_df.iterrows():
    print(type(row))
    print(idx,row['addr'])

<class 'pandas.core.series.Series'>
0 서울
<class 'pandas.core.series.Series'>
1 경기
<class 'pandas.core.series.Series'>
2 부산

In [9]:
#집계함수사용.컬럼추가
data_df['phone'] = ['010-11-22','010-22-33','010-33-44']
data_df

  names  age addr      phone
0    길동   20   서울  010-11-22
1    둘리   10   경기  010-22-33
2    철수   30   부산  010-33-44

In [10]:
len(data_df)
data_df['seq'] = range(1,len(data_df)+1)
data_df

  names  age addr      phone  seq
0    길동   20   서울  010-11-22    1
1    둘리   10   경기  010-22-33    2
2    철수   30   부산  010-33-44    3

In [11]:
data_df['gender'] = ['남','남','남']
data_df

  names  age addr      phone  seq gender
0    길동   20   서울  010-11-22    1      남
1    둘리   10   경기  010-22-33    2      남
2    철수   30   부산  010-33-44    3      남

In [42]:
#나이 최대값,최소,평균,중간
print('최대', data_df['age'].max())  
print('최소', data_df['age'].min())  
print('평균', data_df['age'].mean())  
print('중간', data_df['age'].median())  
print('카운트', data_df['age'].count())  
print('합계', data_df['age'].sum())

최대 30
최소 10
평균 20.0
중간 20.0
카운트 3
합계 60

In [43]:
data_df.describe()

        age
count   3.0
mean   20.0
std    10.0
min    10.0
25%    15.0
50%    20.0
75%    25.0
max    30.0

In [7]:
data_df.tail(2)

  names  age addr
1    둘리   10   경기
2    철수   30   부산

In [8]:
print('몇행 몇열', data_df.shape )
print('컬럼',data_df.columns)
print('인덱스',data_df.index)
print('값들',data_df.values, type(data_df.values))

몇행 몇열 (3, 3)
컬럼 Index(['names', 'age', 'addr'], dtype='object')
인덱스 RangeIndex(start=0, stop=3, step=1)
값들 [['길동' 20 '서울']
 ['둘리' 10 '경기']
 ['철수' 30 '부산']] <class 'numpy.ndarray'>

In [9]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   age     3 non-null      int64
 2   addr    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [10]:
data_df.head()

  names  age addr
0    길동   20   서울
1    둘리   10   경기
2    철수   30   부산

In [11]:
#names 컬럼의 값들을 선택하라 select name from table명
#한개의 열(컬럼)을 선택
print(type(data_df['names']))
data_df['names']

<class 'pandas.core.series.Series'>

0    길동
1    둘리
2    철수
Name: names, dtype: object

In [12]:
#한개의 행 (로우)을 선택
data_df.loc[0]

names    길동
age      20
addr     서울
Name: 0, dtype: object

In [19]:
#Series 객체 생성
series1 = pd.Series([10,20,30])
series1

0    10
1    20
2    30
dtype: int64

In [27]:
series2 = pd.Series({'title':'Dynamite','가수':'방탄'})
series2

title    Dynamite
가수             방탄
dtype: object

In [26]:
song_list = [
    {'title':'Dynamite','가수':'방탄'},
    {'title':'Girl','가수':'블랙핑크'},
]

#비어있는 DataFrame 객체 
data_df = pd.DataFrame(columns=['title','가수'])
data_df

Empty DataFrame
Columns: [title, 가수]
Index: []

In [30]:
for song in song_list:
    #Series 객체 생성
    series_obj = pd.Series(song)
    #Series 객체를 DataFrame 객체에 추가한다.
    data_df = data_df.append(series_obj,ignore_index=True)
    
data_df

      title    가수
0  Dynamite    방탄
1      Girl  블랙핑크

### numpy 사용

In [1]:
import numpy as np

np.arange(1,10+1)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [2]:
for val in np.arange(1,10+1):
    print(val)

1
2
3
4
5
6
7
8
9
10

In [5]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [6]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [7]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [9]:
df3 = df2.set_index('rkey')
df3

      value
rkey
foo       5
bar       6
baz       7
foo       8

In [13]:
df1.merge(df2,left_on='lkey',right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [17]:
df1.merge(df3,left_on='lkey',right_on=df3.index,how='left')

  lkey  value_x  value_y
0  foo        1        5
1  foo        1        8
2  bar        2        6
3  baz        3        7
4  foo        5        5
5  foo        5        8